### Homework 1:

#### import pandas as pd

#### data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Age': [25, 30, 35, 40], 'City': ['New #### York', 'San Francisco', 'Los Angeles', 'Chicago']} df = pd.DataFrame(data)

In [54]:
import pandas as pd 

data = {
    'First Name': ['Alice', 'Bob', 'Charlie', 'David'], 
    'Age': [25, 30, 35, 40], 
    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']} 
df = pd.DataFrame(data)

In [22]:
# 1. Rename column names using function. "First Name" --> "first_name", "Age" --> "age
df = df.rename(columns={'First Name' : 'first_name','Age' : 'age'})
print(df)

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [23]:
# 2. Print the first 3 rows of the DataFrame
first_3_rows = df.head(3)
print(first_3_rows)

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles

In [28]:
# 3. Find the mean age of the individuals
mean_age = df['age'].mean()

print("Mean age:", mean_age)

Mean age: 32.5

In [38]:
# 4. Select and print only the 'Name' and 'City' columns
import pandas as pd 
data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Age': [25, 30, 35, 40], 'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']} 
df = pd.DataFrame(data)

name_city = df[['First Name', 'City']]
print(name_city)

  First Name           City
0      Alice       New York
1        Bob  San Francisco
2    Charlie    Los Angeles
3      David        Chicago

In [47]:
# 5. Add a new column 'Salary' with random salary values
df['Salary'] = [3500, 2000, 6000,2650]
print(df)

  First Name  Age           City  Salary
0      Alice   25       New York    3500
1        Bob   30  San Francisco    2000
2    Charlie   35    Los Angeles    6000
3      David   40        Chicago    2650

In [52]:
# 6.Display summary statistics of the DataFrame
import pandas as pd 
data = {
    'First Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'Salary': [50000, 60000, 70000, 80000]
}
df = pd.DataFrame(data)
print(df.describe())

             Age        Salary
count   4.000000      4.000000
mean   32.500000  65000.000000
std     6.454972  12909.944487
min    25.000000  50000.000000
25%    28.750000  57500.000000
50%    32.500000  65000.000000
75%    36.250000  72500.000000
max    40.000000  80000.000000

### Homework 2:

In [64]:
# 1. Create a Dataframe sales_expenses

import pandas as pd
sales_and_expenses = {
    'Month': ['Jan', 'Feb', 'Mar', 'Apr'],
    'Sales': [5000, 6000, 7500, 8000],
    'Expenses': [3000, 3500, 4000, 4500]
}
df = pd.DataFrame(sales_and_expenses)
print(df)

  Month  Sales  Expenses
0   Jan   5000      3000
1   Feb   6000      3500
2   Mar   7500      4000
3   Apr   8000      4500

In [114]:
# 2. Calculate and display the maximum sales and expenses
import pandas as pd
sales_and_expenses = {
    'Month': ['Jan', 'Feb', 'Mar', 'Apr'],
    'Sales': [5000, 6000, 7500, 8000],
    'Expenses': [3000, 3500, 4000, 4500]
}
df = pd.DataFrame(sales_and_expenses)
max_sales = df['Sales'].max()
max_expenses = df['Expenses'].max()
print('Maximum sales:', max_sales)
print('Maximum expenses:', max_expenses)

Maximum sales: 8000
Maximum expenses: 4500

In [113]:
# 3. Calculate and display the minimum sales and expenses.
import pandas as pd
sales_and_expenses = {
    'Month': ['Jan', 'Feb', 'Mar', 'Apr'],
    'Sales': [5000, 6000, 7500, 8000],
    'Expenses': [3000, 3500, 4000, 4500]
}
df = pd.DataFrame(sales_and_expenses)
min_sales = df['Sales'].min()
min_expenses = df['Expenses'].min()
print('Minimum sales:', min_sales)
print('Minimum expenses:', min_expenses)

Minimum sales: 5000
Minimum expenses: 3000

In [117]:
# 4. Calculate and display the average sales and expenses.
import pandas as pd
sales_and_expenses = {
    'Month': ['Jan', 'Feb', 'Mar', 'Apr'],
    'Sales': [5000, 6000, 7500, 8000],
    'Expenses': [3000, 3500, 4000, 4500]
}
df = pd.DataFrame(sales_and_expenses)
avg_sales = int(df['Sales'].mean())
avg_expenses = int(df['Expenses'].mean())
print('Average sales:', avg_sales)
print('Average expenses',avg_expenses)

Average sales: 6625
Average expenses 3750

### Homework 3:

In [123]:
# 1. Create a DataFrame named expenses with columns 'Category', 'January', 'February', 'March', and 'April', 
# representing monthly expenses for different categories. Use below table.

import pandas as pd 
expenses = {
    'Category': ['Rent', 'Utilities', 'Groceries', 'Entertainment'],
    'January': [1200, 200, 300, 150],
    'February':[1300, 220, 320, 160],
    'March': [1400, 240, 300, 170],
    'April': [1500, 250, 350, 180]
}
df = pd.DataFrame(expenses)
df = df.set_index('Category')
df

               January  February  March  April
Category
Rent              1200      1300   1400   1500
Utilities          200       220    240    250
Groceries          300       320    300    350
Entertainment      150       160    170    180

In [125]:
# 2. Calculate and display the maximum expense for each category.
import pandas as pd 
expenses = {
    'Category': ['Rent', 'Utilities', 'Groceries', 'Entertainment'],
    'January': [1200, 200, 300, 150],
    'February':[1300, 220, 320, 160],
    'March': [1400, 240, 300, 170],
    'April': [1500, 250, 350, 180]
}
df['Max Expense'] = df.max(axis=1)
df

               January  February  March  April  Max Expense
Category
Rent              1200      1300   1400   1500         1500
Utilities          200       220    240    250          250
Groceries          300       320    300    350          350
Entertainment      150       160    170    180          180

In [128]:
# 3. Calculate and display the minimum expense for each category.

df['Min Expense'] = df.min(axis=1)
df

               January  February  March  April  Max Expense  Min Expense
Category
Rent              1200      1300   1400   1500         1500         1200
Utilities          200       220    240    250          250          200
Groceries          300       320    300    350          350          300
Entertainment      150       160    170    180          180          150

In [136]:
# 4. Calculate and display the average expense for each category.
df['Avg Expense'] = (df.mean(axis=1))
df

,January,February,March,April,Max Expense,Min Expense,Avg Expense
Category,,,,,,,
Rent,1200,1300,1400,1500,1500,1200,1350.000000
Utilities,200,220,240,250,250,200,226.666667
Groceries,300,320,300,350,350,300,320.000000
Entertainment,150,160,170,180,180,150,165.000000